{
  "english": {
    "title": "Projects",
    "description": "There are my portfolio projects",
    "projectList": [
      {
        "title": "Book Analyzer",
        "description": "Transform .txt book files into social media-style graphs, similar to Instagram",
        "techStack": [
          "Python",
          "Flask",
          "React",
          "Postgres",
          "Docker",
          "Google Cloud"
        ]
      },
      {
        "title": "Flight Price Scrapper",
        "description": "Powered by Kiwi Tequilla API, this project scrapes flight data from the API and displays it in a user-friendly way. The main focus is to create alerts for the user when the price of a flight drops.",
        "techStack": [
          "Python",
          "Flask",
          "Postgres",
          "Docker",
          "Google Cloud"
        ]
      },
      {
        "title": "Valorant Impact",
        "description": "A tool that quantifies how much player actions can shift the odds of winning a Valorant round. By analyzing kills, weapon choices, economy and strategic moves, it reveals the real-time impact on victory chances.",
        "techStack": [
          "Python",
          "Flask",
          "React",
          "Postgres",
          "Docker",
          "Google Cloud"
        ]
      },
      {
        "title": "MCQ Quiz App",
        "description": "A simple quiz app that I used for studying purposes. You can easily navigate through the questions and check your answers at the end.",
        "techStack": [
          "React",
          "Firebase"
        ]
      }
    ]
  },
  "portuguese": {
    "title": "Projetos",
    "description": "Aqui estão meus projetos de portfólio",
    "projectList": [
      {
        "title": "Analisador de Livros",
        "description": "Transforma livros .txt em grafos ao estilo de redes sociais similares ao Instagram",
        "techStack": [
          "Python",
          "Flask",
          "React",
          "Postgres",
          "Docker",
          "Google Cloud"
        ]
      },
      {
        "title": "Flight Scrapper",
        "description": "Usando a API Kiwi Tequilla, este projeto faz a raspagem de dados de voos da API e os exibe de uma forma simples. O principal foco é criar alertas para o usuário quando o preço de um voo abaixar.",
        "techStack": [
          "Python",
          "Flask",
          "Postgres",
          "Docker",
          "Google Cloud"
        ]
      },
      {
        "title": "Valorant Impact",
        "description": "Uma ferramenta que quantifica o quanto as ações dos jogadores podem alterar as chances de vencer um round no Valorant. Analisando kills, compras de armas, economia e movimentos estratégicos, a ferramenta é capaz de calcular o impacto em tempo real nas chances de vitória do round.",
        "techStack": [
          "Python",
          "Flask",
          "React",
          "Postgres",
          "Docker",
          "Google Cloud"
        ]
      },
      {
        "title": "MCQ Quiz App",
        "description": "Um aplicativo de quiz simples que eu usei para estudar. Você pode navegar facilmente pelas perguntas e verificar suas respostas no final.",
        "techStack": [
          "React",
          "Firebase"
        ]}
    ]
  }
}
