{
  "skills": {
    "api": {
      "icon": "api.png",
      "english": {
        "label": "APIs",
        "description": "I specialize in creating scalable APIs that support extensive data exchange and expand functionality while maintaining high security and performance standards."
      },
      "portuguese": {
        "label": "APIs",
        "description": "Eu me especializo em criar APIs escaláveis que suportam ampla troca de dados e expandem funcionalidades, mantendo altos padrões de segurança e desempenho."
      }
    },
    "backend": {
      "icon": "server.png",
      "english": {
        "label": "Backend",
        "description": "I am able to build and manage the server-side architecture of web applications, by implementing complex server logic, managing database interactions, and ensuring seamless integration of components."
      },
      "portuguese": {
        "label": "Backend",
        "description": "Sou capaz de construir e gerenciar a arquitetura do lado do servidor de aplicações web, implementando lógica complexa de servidor, gerenciando interações com o banco de dados e garantindo a integração perfeita dos componentes."
      }
    },
    "django": {
      "icon": "django.png",
      "english": {
        "label": "Django",
        "description": "Django is a high-level Python web framework. I use it to build scalable, database-driven applications with clean architecture and efficient development practices."
      },
      "portuguese": {
        "label": "Django",
        "description": "Django é uma framework web de alto nível em Python. Uso-o para construir aplicações escaláveis orientadas a banco de dados com arquitetura limpa e práticas eficientes de desenvolvimento."
      }
    },
    "flask": {
      "icon": "flask.png",
      "english": {
        "label": "Flask",
        "description": "Flask is a micro web framework written in Python. I use it to build scalable, database-driven applications with clean architecture and efficient development practices."
      },
      "portuguese": {
        "label": "Flask",
        "description": "Flask é um framework web micro em Python. Uso-o para construir aplicações escaláveis orientadas a banco de dados com arquitetura limpa e práticas eficientes de desenvolvimento."
      }
    },
    "graphviz": {
      "icon": "graphviz.png",
      "english": {
        "label": "Graphviz",
        "description": "I am familiar with the Graphviz library. It is a tool for graph visualization."
      },
      "portuguese": {
        "label": "Graphviz",
        "description": "Sou familiarizado com a biblioteca Graphviz. É uma ferramenta para visualização de grafos."
      }
    },
    "networkx": {
      "icon": "networkx.png",
      "english": {
        "label": "NetworkX",
        "description": "I am familiar with the NetworkX library. It is a tool for creating and manipulating graphs."
      },
      "portuguese": {
        "label": "NetworkX",
        "description": "Sou familiarizado com a biblioteca NetworkX. É uma ferramenta para criar e manipular grafos."
      }
    },
    "nlp": {
      "icon": "nlp.png",
      "english": {
        "label": "NLP",
        "description": "I am proficient in natural language processing, leveraging advanced machine learning algorithms to extract meaningful insights from text data."
      },
      "portuguese": {
        "label": "Processamento de Linguagem Natural",
        "description": "Tenho proficiência em processamento de linguagem natural, aproveitando algoritmos avançados de aprendizado de máquina para extrair insights significativos de dados textuais."
      }
    },
    "numpy": {
      "icon": "numpy.png",
      "english": {
        "label": "NumPy",
        "description": "I am familiar with the NumPy library. It is a tool for scientific computing and linear algebra."
      },
      "portuguese": {
        "label": "NumPy",
        "description": "Sou familiarizado com a biblioteca NumPy. É uma ferramenta para computação científica e álgebra linear."
      }
    },
    "pandas": {
      "icon": "pandas.png",
      "english": {
        "label": "Pandas",
        "description": "I am familiar with the Pandas library. It is a tool for sheet manipulation and data organization."
      },
      "portuguese": {
        "label": "Pandas",
        "description": "Sou familiarizado com a biblioteca Pandas. É uma ferramenta para manipulação e organização de dados em tabelas."
      }
    },
    "spacy": {
      "icon": "spacy.png",
      "english": {
        "label": "SpaCy",
        "description": "I am familiar with the SpaCy library. It is a tool for natural language processing."
      },
      "portuguese": {
        "label": "SpaCy",
        "description": "Sou familiarizado com a biblioteca SpaCy. É uma ferramenta para processamento de linguagem natural."
      }
    },
    "firebase": {
      "icon": "firebase.png",
      "english": {
        "label": "Firebase",
        "description": "I am familiar with Firebase, a comprehensive development platform by Google for building and scaling web and mobile applications, providing real-time database, authentication, cloud functions, and hosting services."
      },
      "portuguese": {
        "label": "Firebase",
        "description": "Sou familiarizado com o Firebase, uma plataforma de desenvolvimento abrangente do Google para construir e escalar aplicações web e móveis, oferecendo banco de dados em tempo real, autenticação, funções em nuvem e serviços de hospedagem."
      }
    },
    "matplotlib": {
      "icon": "matplotlib.png",
      "english": {
        "label": "Matplotlib",
        "description": "I am familiar with Matplotlib, a comprehensive library for creating static, animated, and interactive visualizations in Python."
      },
      "portuguese": {
        "label": "Matplotlib",
        "description": "Sou familiarizado com o Matplotlib, uma biblioteca abrangente para criar visualizações estáticas, animadas e interativas em Python."
      }
    },
    "selenium": {
      "icon": "selenium.png",
      "english": {
        "label": "Selenium",
        "description": "I have experience using Selenium, a tool for automating web browsers, useful for testing and scraping web applications."
      },
      "portuguese": {
        "label": "Selenium",
        "description": "Tenho experiência em usar o Selenium, uma ferramenta para automatizar navegadores web, útil para testar e extrair dados de aplicações web."
      }
    },
    "telegram": {
      "icon": "telegram.png",
      "english": {
        "label": "Telegram Bot API",
        "description": "I have experience working with the Telegram Bot API, allowing me to create bots that interact with users via Telegram, automating tasks and sending notifications using Python."
      },
      "portuguese": {
        "label": "API do Bot do Telegram",
        "description": "Tenho experiência em trabalhar com a API do Bot do Telegram, permitindo-me criar bots que interagem com usuários via Telegram, automatizando tarefas e enviando notificações usando Python."
      }
    }
  }
}
