{
  "skills": {
    "api": {
      "icon": "api.png",
      "english": {
        "label": "APIs",
        "description": "I specialize in creating scalable APIs that support extensive data exchange and expand functionality while maintaining high security and performance standards."
      },
      "portuguese": {
        "label": "APIs",
        "description": "Eu me especializo em criar APIs escaláveis que suportam ampla troca de dados e expandem funcionalidades, mantendo altos padrões de segurança e desempenho."
      }
    },
    "backend": {
      "icon": "server.png",
      "english": {
        "label": "Backend",
        "description": "I am able to build and manage the server-side architecture of web applications, by implementing complex server logic, managing database interactions, and ensuring seamless integration of components."
      },
      "portuguese": {
        "label": "Backend",
        "description": "Sou capaz de construir e gerenciar a arquitetura do lado do servidor de aplicações web, implementando lógica complexa de servidor, gerenciando interações com o banco de dados e garantindo a integração perfeita dos componentes."
      }
    },
    "data-analysis": {
      "icon": "data_analysis.png",
      "english": {
        "label": "Data Analysis",
        "description": "I am proficient in extracting, cleaning, and interpreting data to uncover meaningful insights. This includes performing statistical analysis, creating data visualizations, and utilizing various tools and techniques to support data-driven decision making."
      },
      "portuguese": {
        "label": "Análise de Dados",
        "description": "Sou proficiente em extrair, limpar e interpretar dados para descobrir insights significativos. Isso inclui realizar análises estatísticas, criar visualizações de dados e utilizar diversas ferramentas e técnicas para apoiar a tomada de decisões baseada em dados."
      }
    },
    "django": {
      "icon": "django.png",
      "english": {
        "label": "Django",
        "description": "Django is a high-level Python web framework. I use it to build scalable, database-driven applications with clean architecture and efficient development practices."
      },
      "portuguese": {
        "label": "Django",
        "description": "Django é uma framework web de alto nível em Python. Uso-o para construir aplicações escaláveis orientadas a banco de dados com arquitetura limpa e práticas eficientes de desenvolvimento."
      }
    },
    "flask": {
      "icon": "flask.png",
      "english": {
        "label": "Flask",
        "description": "Flask is a micro web framework written in Python. I use it to build scalable, database-driven applications with clean architecture and efficient development practices."
      },
      "portuguese": {
        "label": "Flask",
        "description": "Flask é um framework web micro em Python. Uso-o para construir aplicações escaláveis orientadas a banco de dados com arquitetura limpa e práticas eficientes de desenvolvimento."
      }
    },
    "graphviz": {
      "icon": "graphviz.png",
      "english": {
        "label": "Graphviz",
        "description": "I am familiar with the Graphviz library. It is a tool for graph visualization."
      },
      "portuguese": {
        "label": "Graphviz",
        "description": "Sou familiarizado com a biblioteca Graphviz. É uma ferramenta para visualização de grafos."
      }
    },
    "lightgbm": {
      "icon": "lightgbm.png",
      "english": {
        "label": "LightGBM",
        "description": "Using LightGBM, I develop high-performance gradient boosting models by managing data preprocessing, feature engineering, hyperparameter tuning, model training, and evaluation to ensure precise and efficient predictions."
      },
      "portuguese": {
        "label": "LightGBM",
        "description": "Utilizando o LightGBM, desenvolvo modelos de gradient boosting de alto desempenho, realizando pré-processamento de dados, engenharia de características, ajuste de hiperparâmetros, treinamento e avaliação para garantir previsões precisas e eficientes."
      }
    },
    "machine-learning": {
      "icon": "machine_learning.png",
      "english": {
        "label": "Machine Learning",
        "description": "I am capable of designing, developing, and deploying machine learning models by handling data preprocessing, feature engineering, model training, and evaluation to enable systems to learn from data and make accurate predictions or decisions."
      },
      "portuguese": {
        "label": "Aprendizado de Máquina",
        "description": "Sou capaz de projetar, desenvolver e implantar modelos de aprendizado de máquina, realizando pré-processamento de dados, engenharia de características, treinamento e avaliação de modelos para permitir que os sistemas aprendam a partir dos dados e façam previsões ou decisões precisas."
      }
    },
    "networkx": {
      "icon": "networkx.png",
      "english": {
        "label": "NetworkX",
        "description": "I am familiar with the NetworkX library. It is a tool for creating and manipulating graphs."
      },
      "portuguese": {
        "label": "NetworkX",
        "description": "Sou familiarizado com a biblioteca NetworkX. É uma ferramenta para criar e manipular grafos."
      }
    },
    "nlp": {
      "icon": "nlp.png",
      "english": {
        "label": "NLP",
        "description": "I am proficient in natural language processing, leveraging advanced machine learning algorithms to extract meaningful insights from text data."
      },
      "portuguese": {
        "label": "Processamento de Linguagem Natural",
        "description": "Tenho proficiência em processamento de linguagem natural, aproveitando algoritmos avançados de aprendizado de máquina para extrair insights significativos de dados textuais."
      }
    },
    "numpy": {
      "icon": "numpy.png",
      "english": {
        "label": "NumPy",
        "description": "I am familiar with the NumPy library. It is a tool for scientific computing and linear algebra."
      },
      "portuguese": {
        "label": "NumPy",
        "description": "Sou familiarizado com a biblioteca NumPy. É uma ferramenta para computação científica e álgebra linear."
      }
    },
    "optuna": {
      "icon": "optuna.png",
      "english": {
        "label": "Optuna",
        "description": "Leveraging Optuna, I perform efficient hyperparameter optimization for machine learning models by defining search spaces, configuring algorithms, conducting experiments, and analyzing outcomes to boost model accuracy."
      },
      "portuguese": {
        "label": "Optuna",
        "description": "Aproveitando o Optuna, realizo otimização eficiente de hiperparâmetros para modelos de aprendizado de máquina, definindo espaços de busca, configurando algoritmos, conduzindo experimentos e analisando resultados para aumentar a precisão do modelo."
      }
    },
    "pandas": {
      "icon": "pandas.png",
      "english": {
        "label": "Pandas",
        "description": "I am familiar with the Pandas library. It is a tool for sheet manipulation and data organization."
      },
      "portuguese": {
        "label": "Pandas",
        "description": "Sou familiarizado com a biblioteca Pandas. É uma ferramenta para manipulação e organização de dados em tabelas."
      }
    },
    "seaborn": {
      "icon": "seaborn.png",
      "english": {
        "label": "Seaborn",
        "description": "Skilled in Seaborn, I design informative and visually appealing statistical graphics, including heatmaps, violin plots, and pair plots, while customizing visualizations for clarity and integrating them with other data analysis tools."
      },
      "portuguese": {
        "label": "Seaborn",
        "description": "Habilidoso em Seaborn, crio gráficos estatísticos informativos e visualmente atraentes, incluindo heatmaps, violin plots e pair plots, personalizando visualizações para maior clareza e integrando-as com outras ferramentas de análise de dados."
      }
    },
    "spacy": {
      "icon": "spacy.png",
      "english": {
        "label": "SpaCy",
        "description": "I am familiar with the SpaCy library. It is a tool for natural language processing."
      },
      "portuguese": {
        "label": "SpaCy",
        "description": "Sou familiarizado com a biblioteca SpaCy. É uma ferramenta para processamento de linguagem natural."
      }
    },
    "scikit-learn": {
      "icon": "scikit_learn.png",
      "english": {
        "label": "Scikit-Learn",
        "description": "Expertise in Scikit-Learn enables me to develop and deploy machine learning models, covering data preprocessing, feature selection, model training, evaluation, and tuning with a diverse set of algorithms for robust predictive solutions."
      },
      "portuguese": {
        "label": "Scikit-Learn",
        "description": "Com expertise em Scikit-Learn, desenvolvo e implanto modelos de aprendizado de máquina, abrangendo pré-processamento de dados, seleção de características, treinamento de modelos, avaliação e ajuste com uma variedade de algoritmos para soluções preditivas robustas."
      }
    },
    "scipy": {
      "icon": "scipy.png",
      "english": {
        "label": "SciPy",
        "description": "Utilizing SciPy, I perform advanced scientific and numerical computations, including complex mathematical operations, optimization, signal processing, and statistical analysis to create effective solutions for scientific and engineering challenges."
      },
      "portuguese": {
        "label": "SciPy",
        "description": "Utilizando o SciPy, realizo cálculos científicos e numéricos avançados, incluindo operações matemáticas complexas, otimização, processamento de sinais e análise estatística para criar soluções eficazes para desafios científicos e de engenharia."
      }
    },
    "firebase": {
      "icon": "firebase.png",
      "english": {
        "label": "Firebase",
        "description": "I am familiar with Firebase, a comprehensive development platform by Google for building and scaling web and mobile applications, providing real-time database, authentication, cloud functions, and hosting services."
      },
      "portuguese": {
        "label": "Firebase",
        "description": "Sou familiarizado com o Firebase, uma plataforma de desenvolvimento abrangente do Google para construir e escalar aplicações web e móveis, oferecendo banco de dados em tempo real, autenticação, funções em nuvem e serviços de hospedagem."
      }
    },
    "matplotlib": {
      "icon": "matplotlib.png",
      "english": {
        "label": "Matplotlib",
        "description": "Proficient in Matplotlib, I create static, animated, and interactive visualizations in Python, enhancing data representation and insight communication."
      },
      "portuguese": {
        "label": "Matplotlib",
        "description": "Proficiente em Matplotlib, crio visualizações estáticas, animadas e interativas em Python, aprimorando a representação de dados e a comunicação de insights."
      }
    },
    "selenium": {
      "icon": "selenium.png",
      "english": {
        "label": "Selenium",
        "description": "I have experience using Selenium, a tool for automating web browsers, useful for testing and scraping web applications."
      },
      "portuguese": {
        "label": "Selenium",
        "description": "Tenho experiência em usar o Selenium, uma ferramenta para automatizar navegadores web, útil para testar e extrair dados de aplicações web."
      }
    },
    "telegram": {
      "icon": "telegram.png",
      "english": {
        "label": "Telegram Bot API",
        "description": "I have experience working with the Telegram Bot API, allowing me to create bots that interact with users via Telegram, automating tasks and sending notifications using Python."
      },
      "portuguese": {
        "label": "API do Bot do Telegram",
        "description": "Tenho experiência em trabalhar com a API do Bot do Telegram, permitindo-me criar bots que interagem com usuários via Telegram, automatizando tarefas e enviando notificações usando Python."
      }
    }
  }
}
